Class02/blog/app/controllers/users_controller.rb

  def old
    @users = User.all :conditions => "age > #{params[:age]||50}"
---
SELECT * FROM "users" WHERE ("users"."age" = '70')

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "profile", "updated_at", "male", "age") VALUES('Miguel', '2011-04-27 16:03:04', 'Um tipo e tal.', '2011-04-27 16:03:04', 't', 97)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2011-04-27 16:04:40', "age" = 96 WHERE "id" = 1